Revit 2027 API
PolyLine.Clone Method
Returns a copy of this polyline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PolyLine Clone()
Public Function Clone As PolyLine
public:
PolyLine^ Clone()
member Clone : unit -> PolyLine
Return Value
PolyLine
See Also
Reference
PolyLine Class
Autodesk.Revit.DB Namespace